conf/emacs.org
#+title Emacs execute stuff and tangle conf
#+PROPERTY: header-args:emacs-lisp :tangle ./init-new.el
* Snippet
** Python
#+begin_src python :results output
   print("hello people")
#+end_src

#+RESULTS:
: hello people
#+begin_src python :results output
   print("hello people")
#+end_src


** C
#+begin_src C
  printf ("Hello World!\n");
#+end_src

#+RESULTS:
: Hello World!
** C++
#+begin_src C++ :includes <iostream>
  std::cout<<"Hello World!\n";
#+end_src

#+RESULTS:
: Hello World!

* Init File
** Basic UI Configuration
#+begin_src emacs-lisp
;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
;;       in Emacs and init.el will be generated automatically!

;; You will most likely need to adjust this font size for your system!
(defvar efs/default-font-size 100)
(defvar efs/default-variable-font-size 100)

;; Make frame transparency overridable
(defvar efs/frame-transparency '(90 . 90))

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                     (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src
** Load Package Configuration
- State "DONE"       from "NEXT"       [2021-04-26 Mon 21:
  #+begin_src emacs-lisp 
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))


  #+end_src
